miniACS_V1_37/Win/Tr69-Scripts/v7/181_SetVoiceConfigDT-BRN.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Header>
<ns1:ID soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next" soapenv:mustUnderstand="1" xsi:type="xsd:string" xmlns:ns1="urn:dslforum-org:cwmp-1-0">ACS_SetParameterValues_7</ns1:ID>
</soapenv:Header>
<soapenv:Body>
<ns2:SetParameterValues soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="urn:dslforum-org:cwmp-1-0">
<ParameterList soapenc:arrayType="ns2:ParameterValueStruct[17]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.X_T-ONLINE-DE_IpOnly</Name>
<Value xsi:type="xsd:boolean">false</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.SIP.1.ProxyServer</Name>
<Value xsi:type="xsd:string">114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.STUNServer</Name>
<Value xsi:type="xsd:string">stun.t-online.de</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.1.URI</Name>
<Value xsi:type="xsd:string">sip:004991242604050@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.1.AuthUserName</Name>
<Value xsi:type="xsd:string">access-user-tk01@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.1.AuthPassword</Name>
<Value xsi:type="xsd:string">123456</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.2.URI</Name>
<Value xsi:type="xsd:string">sip:004932490199522@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.2.AuthUserName</Name>
<Value xsi:type="xsd:string">access-user-tk01@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.2.AuthPassword</Name>
<Value xsi:type="xsd:string">123456</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.3.URI</Name>
<Value xsi:type="xsd:string">sip:004991242604051@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.3.AuthUserName</Name>
<Value xsi:type="xsd:string">access-user-tk01@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.3.AuthPassword</Name>
<Value xsi:type="xsd:string">123456</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.4.URI</Name>
<Value xsi:type="xsd:string">sip:004991242604999@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.4.AuthUserName</Name>
<Value xsi:type="xsd:string">access-user-tk01@114.32.247.103</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.SIPLine.4.AuthPassword</Name>
<Value xsi:type="xsd:string">123456</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.DeviceInfo.ProvisioningCode</Name>
<Value xsi:type="xsd:string">000.004.004.000</Value>
</ParameterValueStruct>
<ParameterValueStruct xsi:type="ns2:ParameterValueStruct">
<Name xsi:type="xsd:string">Device.Services.VoiceService.1.Networks.Profile.1.Enable</Name>
<Value xsi:type="xsd:string">Enabled</Value>
</ParameterValueStruct>
</ParameterList>
<ParameterKey xsi:type="xsd:string">ACS</ParameterKey>
</ns2:SetParameterValues>
</soapenv:Body>
</soapenv:Envelope>
